; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v7 - type_3 ?v2 - type_2)
 	      (pred_4 ?v8 - object ?v2 - type_2)
	      (pred_2 ?v7 - type_3 ?v4 - type_1)
	      (pred_1 ?v7 - type_3 ?v8 - object ?v4 - type_1))

   (:action op_3
       :parameters  (?v7 - type_3 ?v5 ?v6 - type_2)
       :precondition (and  (pred_3 ?v7 ?v5))
       :effect (and  (pred_3 ?v7 ?v6)
		     (not (pred_3 ?v7 ?v5))))

   (:action op_2
       :parameters (?v7 - type_3 ?v1 - object ?v3 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_4 ?v1 ?v3) (pred_3 ?v7 ?v3) (pred_2 ?v7 ?v4))
       :effect (and (pred_1 ?v7 ?v1 ?v4)
		    (not (pred_4 ?v1 ?v3)) 
		    (not (pred_2 ?v7 ?v4))))

   (:action op_1
       :parameters (?v7 - type_3 ?v1 - object ?v3 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_1 ?v7 ?v1 ?v4) (pred_3 ?v7 ?v3))
       :effect (and (pred_4 ?v1 ?v3)
		    (pred_2 ?v7 ?v4)
		    (not (pred_1 ?v7 ?v1 ?v4)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_03 - type_3
obj_02 obj_01 - type_1
obj_05 obj_09 obj_08 obj_10 - type_2
obj_04 obj_06 obj_07 - object)
(:init
(pred_3 obj_03 obj_08)
(pred_2 obj_03 obj_02)
(pred_2 obj_03 obj_01)
(pred_4 obj_04 obj_08)
(pred_4 obj_06 obj_10)
(pred_4 obj_07 obj_10)
)
(:goal
(and
(pred_4 obj_04 obj_08)
(pred_4 obj_06 obj_08)
(pred_4 obj_07 obj_10)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_03 ?b obj_01))))
)
)

; plan
1. (op_3 obj_03 obj_08 obj_10)
   deleted: (pred_3 obj_03 obj_08)
   added: (pred_3 obj_03 obj_10)
   goals met: 2 of 3
2. (op_2 obj_03 obj_06 obj_10 obj_02)
   deleted: (pred_4 obj_06 obj_10) (pred_2 obj_03 obj_02)
   added: (pred_1 obj_03 obj_06 obj_02)
   goals met: 2 of 3
3. (op_3 obj_03 obj_10 obj_08)
   deleted: (pred_3 obj_03 obj_10)
   added: (pred_3 obj_03 obj_08)
   goals met: 2 of 3
4. (op_1 obj_03 obj_06 obj_08 obj_02)
   deleted: (pred_1 obj_03 obj_06 obj_02)
   added: (pred_4 obj_06 obj_08) (pred_2 obj_03 obj_02)
   goals met: 3 of 3
